
-- 章 \\, 节 \\, 章名 \\, 节名 \\, 怪物 \\, 道具 \\, 英雄 \\, 章备注 \\, 节备注
duplicate_1 = "1\\,1\\,第一章\\,第一节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第一节备注"
duplicate_2 = "1\\,2\\,第一章\\,第二节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第二节备注"
duplicate_3 = "1\\,3\\,第一章\\,第三节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第三节备注"
duplicate_4 = "1\\,4\\,第一章\\,第四节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第四节备注"
duplicate_5 = "1\\,5\\,第一章\\,第五节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第五节备注"
duplicate_6 = "1\\,6\\,第一章\\,第六节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第六节备注"
duplicate_7 = "1\\,7\\,第一章\\,第七节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第七节备注"
duplicate_8 = "1\\,8\\,第一章\\,第八节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第八节备注"
duplicate_9 = "1\\,9\\,第一章\\,第九节\\,xxx\\,yyy\\,zzz\\,第一章备注\\,第九节备注"
duplicate_10 = "2\\,1\\,第二章\\,第一节\\,xxx\\,yyy\\,zzz\\,第二章备注\\,第一节备注"
