
index = "100,101,102,103,104,105,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124"

--id,Name,Type,Atk,Def,Hp,Speed,Dex攻击速度,Range触发范围,AtkRange技能范围,AtkGroup,DefGroup,HpGroup,SpeedGroup,DexGroup,RangeGroup,BuyDiamond,Desc,Skillhurt

function baseGeneral(baseId)
	if baseId == 100 then
		return "大娃", 1, 4, 2, 6, 3, 2, 6, 3, 2, 1, 2, 0, 0, 1, 100, "互撸娃,大娃,擅长巨大化.在一次模仿大头儿子选秀中,折断颈椎而亡.#第一周连续登陆解锁", 10

	elseif baseId == 101 then
		return "六娃", 2, 2, 2, 4, 4, 2, 8, 3, 1, 2, 2, 0, 0, 1, 100, "互撸娃,六娃,擅长隐身.前往隐身科技展览中,在自动感应门前,撞门而亡.#钻石购买解锁", 10
	
	elseif baseId == 102 then
		return "金正恩", 2, 3, 2, 2, 3, 2, 7, 3, 1, 2, 2, 0, 0, 1, 100, "金三胖,要让美国毁灭的人,世界最强大国家”朝鲜”的领导人.#钻石购买解锁", 10
	
	elseif baseId == 103 then
		return "暴漫", 2, 3, 3, 4, 4, 2, 6, 3, 1, 2, 2, 0, 0, 1, 100, "暴走漫画,未成年人不可观看.不看暴漫的人,整条街的智商都被你拉低了.#通关第一章解锁", 10
	
	elseif baseId == 104 then
		return "mj", 3, 2, 4, 8, 3, 2, 6, 3, 1, 1, 3, 0, 0, 1, 200, "迈克杰克逊,擅长歌舞,不喜欢代言黑人牙膏.#钻石购买解锁", 10
	
	elseif baseId == 105 then
		return "哪吒", 1, 4, 2, 6, 3, 2, 6, 3, 2, 1, 2, 0, 0, 1, 0, "哪吒,李靖第三子,不喜欢吃肉丸.本是同根生,相煎何太急.#初始英雄", 10
	
	elseif baseId == 107 then
		return "蜡笔小新", 3, 2, 4, 8, 3, 2, 6, 3, 1, 1, 3, 0, 0, 1, 150, "蜡笔小新,美女爱好者,动感超人的忠实粉丝.#钻石购买解锁", 10
	
	elseif baseId == 108 then
		return "路飞", 1, 3, 1, 6, 3, 2, 7, 3, 2, 1, 2, 0, 0, 1, 100, "草帽路飞,他的目标是,成为海贼王的男人.#通关第二章解锁", 10
	
	elseif baseId == 109 then
		return "女帝", 3, 2, 2, 4, 4, 3, 5, 3, 1, 1, 3, 0, 0, 1, 100, "九蛇岛主,她的目标是,成为海贼王的女人.#钻石购买解锁", 10
	
	elseif baseId == 110 then
		return "擎天柱", 1, 4, 2, 6, 3, 2, 8, 3, 2, 1, 2, 0, 0, 1, 200, "擎天柱,也称”早晨擎天柱“,绝招”一柱擎天“,是汽车人的领袖.#钻石购买解锁", 10
	
	elseif baseId == 111 then
		return "龟仙人", 2, 1, 5, 8, 3, 2, 8, 3, 1, 2, 2, 0, 0, 1, 100, "龟族的领袖,以前不叫龟仙人,后来改名了.毕竟龟仙人比x头好听.#通关第三章解锁", 10
	
	elseif baseId == 112 then
		return "钢铁侠", 2, 3, 3, 6, 3, 2, 8, 3, 1, 2, 2, 0, 0, 1, 200, "钢铁侠,高富帅,自制变身装备.美少女变身,钢铁侠!少女般的身躯,钢铁般的意志.#钻石购买解锁", 10
	
	elseif baseId == 113 then
		return "女王大人", 1, 2, 2, 4, 4, 3, 7, 3, 2, 1, 2, 0, 0, 1, 100, "女王大人,美丽御姐.香蕉收藏者,黄瓜爱好者,仅此而已.#第二周连续登陆解锁", 10
	
	elseif baseId == 114 then
		return "水冰月", 3, 3, 3, 4, 3, 3, 0, 3, 1, 1, 3, 0, 0, 0, 100, "月亮的代言人,《你的月亮我的心》主持人,成名曲《月亮代表我的心》.#第四周连续登陆解锁", 10
	
	elseif baseId == 115 then
		return "初音", 2, 3, 3, 4, 3, 3, 0, 3, 1, 2, 2, 0, 0, 0, 50, "初音,歌舞大师!嗯~,只要998,初音带回家,白天可以亲亲她,晚上还能啪啪啪.#钻石购买解锁", 10
	
	elseif baseId == 116 then
		return "超人", 1, 4, 2, 6, 3, 2, 8, 3, 2, 1, 2, 0, 0, 1, 100, "超人,出生于氪星,名克拉克.那是只鸟?那是飞机?那是....超人!#钻石购买解锁", 10
	
	elseif baseId == 117 then
		return "春丽", 1, 3, 4, 8, 3, 2, 8, 3, 2, 1, 2, 0, 0, 1, 0, "街头霸王经典人物,美丽的女格斗家,wwe女子组冠军.#初始英雄", 10
	
	elseif baseId == 118 then
		return "樱木花道", 1, 3, 4, 8, 3, 2, 9, 3, 2, 1, 2, 0, 0, 1, 100, "灌篮高手主角,擅长失恋....失恋记录刷新中.......#第三周连续登陆解锁", 10
	
	elseif baseId == 119 then
		return "奥特曼", 1, 2, 3, 8, 3, 2, 7, 3, 2, 1, 2, 0, 0, 1, 100, "凹凸曼,性别:不详;出身:M78星云;擅长:打怪兽;爱好:与地球男子合体.#钻石购买解锁", 10
	
	elseif baseId == 120 then
		return "雷神", 4, 3, 1, 6, 3, 2, 9, 1, 3, 1, 2, 0, 0, 2, 150, "雷神,一个喜欢讲冷笑的神.#钻石购买解锁", 10
	
	elseif baseId == 121 then
		return "绿巨人", 1, 4, 2, 6, 3, 2, 0, 3, 2, 1, 2, 0, 0, 0, 150, "绿巨人,全身油绿.下一集的绿巨人,主演:谢霆锋;导演:陈冠希.#钻石购买解锁", 10
	
	elseif baseId == 122 then
		return "猫女", 6, 3, 3, 4, 1, 2, 6, 3, 1, 1, 2, 1, 0, 1, 100, "猫女,蝙蝠侠的爱慕对象.性感诱人,身姿矫健.#钻石购买解锁", 10
	
	elseif baseId == 123 then
		return "阿拉蕾", 6, 3, 1, 6, 1, 2, 9, 3, 1, 1, 2, 1, 0, 1, 0, "怪博士与机器娃娃的主角,喜欢玩大便.那个,你看见我的大便了吗?#初始英雄", 10
	
	elseif baseId == 124 then
		return "卖火柴", 1, 5, 1, 6, 3, 3, 0, 3, 3, 1, 2, 0, 0, 0, 100, "我点亮一根火柴,所有菜2块钱,房租99块钱,主席坐在我身边说.#钻石购买解锁", 10
	else
		return "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "", 0
	end
end

--英雄升级所需金币
level_up_coin = "100,1000,5000,20000,50000,0"

init_generals = "105,117,123"